Core/src/DataProcessors/AzRyАнализПотребности/AzRyАнализПотребности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AzRyАнализПотребности</name>
</mdclass:DataProcessor>

Core/src/AccumulationRegisters/ЗаказыПоставщикам/ЗаказыПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПоставщикам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/ОплатаСчетовИЗаказов/ОплатаСчетовИЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОплатаСчетовИЗаказов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаАванса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаОплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.СчетНаОплату</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.СчетНаОплатуПоставщика</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/Закупки/Закупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Закупки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗакупкаЛицензий</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.СборкаЗапасов</types>
      <types>DocumentRef.ДополнительныеРасходы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/DataProcessors/AzRyАнализПотребности/Forms/Форма/Module.bsl
&НаСервере
Перем ДатаНачало;

&НаСервере
Перем ДатаКонец;

&НаСервере
Процедура ЗаполнитьБазуТоваров()
	
	СхемаКомпоновкиДанных = ЭтотОбъект().ПолучитьМакет("Макет");
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Компоновщик.Настройки.Отбор.Элементы.Очистить();
	
	СкопироватьЭлементы(Компоновщик.Настройки.Отбор, КомпоновщикНастроек.Настройки.Отбор);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Компоновщик.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ДатаКонец = ?(КонецПериода = Дата(1,1,1), Дата(2900,12,31), КонецДня(КонецПериода)); 
	ДатаНачало = ?(НачалоПериода = Дата(1,1,1), Дата(1980,1,1), НачалоДня(НачалоПериода));
	
	Запрос1 = Новый Запрос;
	Запрос1.Текст = МакетКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос;
	
	Запрос1.УстановитьПараметр("НачалоПериода", ДатаНачало);
	Запрос1.УстановитьПараметр("КонецПериода", ДатаКонец);  
	
	ОтборСтруктурнаяЕдиница = Новый Структура;
	ОтборСтруктурнаяЕдиница.Вставить("СтруктурнаяЕдиница", Неопределено);
	Н = 0;
	Для каждого фыв Из КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл	
		Н = Н + 1;
		Если Строка(фыв.ЛевоеЗначение) = "СтруктурнаяЕдиница" Тогда
			ОтборСтруктурнаяЕдиница.Вставить("СтруктурнаяЕдиница", фыв); 
		КонецЕсли; 	
	КонецЦикла;
	
	// Заполнение параметров с полей отбора компоновщика настроек формы обработки.
	Для каждого Параметр Из МакетКомпоновкиДанных.ЗначенияПараметров Цикл				
		Запрос1.Параметры.Вставить(Параметр.Имя, Параметр.Значение);		 
	КонецЦикла;
	
	Запрос1.Текст = Запрос1.Текст + 
	               " ИТОГИ
	               |	МАКСИМУМ(Требуется),
	               |	СУММА(КоличествоНаСкладе),
	               |	МАКСИМУМ(Заказано),
	               |	СУММА(НужноеКоличество)
	               |ПО
	               |	Регистратор,	
				   |	Номенклатура";			   
				   
	Результат = Запрос1.Выполнить();
	СпособОбхода = ОбходРезультатаЗапроса.ПоГруппировкамСИерархией;
	ТекТаблица = Результат.Выгрузить(СпособОбхода);
	
	соот = Новый Соответствие;
	Для каждого ТекСтрока Из ТекТаблица.Строки Цикл
		ТекСтрока.НужноеКоличество = ?((ТекСтрока.Требуется - ТекСтрока.КоличествоНаСкладе - ТекСтрока.Заказано) < 0, 0, (ТекСтрока.Требуется - ТекСтрока.КоличествоНаСкладе - ТекСтрока.Заказано));
		соот.Вставить("Требуется", 0);
		Для каждого ТекСтрока2 Из ТекСтрока.Строки Цикл
			 
			ТекСтрока2.НужноеКоличество = ?((ТекСтрока2.Требуется - ТекСтрока2.КоличествоНаСкладе - ТекСтрока2.Заказано) < 0, 0, (ТекСтрока2.Требуется - ТекСтрока2.КоличествоНаСкладе - ТекСтрока2.Заказано));
			
			соот["Требуется"] = соот["Требуется"] + ТекСтрока2.Требуется;
			//ТекСтрока2.ВебАдрес = ТекСтрока2.Номенклатура.AzRyНаименованияПоставщиков.ВебАдрес;
            ТекСтрока2.ДатаНаПроизводство = ТекСтрока2.Регистратор.Старт;
			
			М = Новый Массив;
			Для каждого ТекСтрока3 Из ТекСтрока2.Строки Цикл
				
				Если ЗначениеЗаполнено(ТекСтрока3.AzRyНаименованияПоставщиков) Тогда
					ТекСтрока2.ВебАдрес = ТекСтрока3.AzRyНаименованияПоставщиков.ВебАдрес;
					ТекСтрока3.ВебАдрес = ТекСтрока3.AzRyНаименованияПоставщиков.ВебАдрес;
				КонецЕсли; 
				
				
				// Фильтр СтруктурнаяЕдиница
				Если Не ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница = Неопределено Тогда	
					// Равно
					Если ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно И ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница.Использование Тогда
						Если ТекСтрока3.СтруктурнаяЕдиница <> ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница.ПравоеЗначение Тогда
							М.Добавить(ТекСтрока3);
						КонецЕсли; 
					КонецЕсли; 
					// НеРавно
					Если ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно И ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница.Использование Тогда
						Если ТекСтрока3.СтруктурнаяЕдиница = ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница.ПравоеЗначение Тогда
							М.Добавить(ТекСтрока3);
						КонецЕсли; 
					КонецЕсли;
					// ВСписке
					Если ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке И ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница.Использование Тогда
						Если ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница.ПравоеЗначение.НайтиПоЗначению(ТекСтрока3.СтруктурнаяЕдиница) = Неопределено Тогда
							М.Добавить(ТекСтрока3);
						КонецЕсли; 
					КонецЕсли;
					// НеВСписке
					Если ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница.ВидСравнения = ВидСравненияКомпоновкиДанных.НеВСписке И ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница.Использование Тогда
						Если Не ОтборСтруктурнаяЕдиница.СтруктурнаяЕдиница.ПравоеЗначение.НайтиПоЗначению(ТекСтрока3.СтруктурнаяЕдиница) = Неопределено Тогда
							М.Добавить(ТекСтрока3);
						КонецЕсли; 
					КонецЕсли;					
					
				КонецЕсли;
				
				ТекСтрока3.Требуется = 0;
				ТекСтрока3.Заказано = 0;
				ТекСтрока3.НужноеКоличество = 0;
				
				ТекСтрока2.AzRyКоментарий = ТекСтрока3.AzRyКоментарий;
				ТекСтрока2.AzRyПриоритет = ТекСтрока3.AzRyПриоритет;
				ТекСтрока2.AzRyРезервЗакупки = ТекСтрока3.AzRyРезервЗакупки;
				ТекСтрока2.ДатаПоступления = ТекСтрока3.ДатаПоступления;
				
				//Если ЗначениеЗаполнено(ТекСтрока2.Регистратор) Тогда 
				//ТекСтрока3.ВебАдрес = ТекСтрока2.Номенклатура.AzRyНаименованияПоставщиков.ВебАдрес;
				//КонецЕсли;	

				//ТекСтрока3.ДатаНаПроизводство = ТекСтрока2.Регистратор.Старт;
				//Если ТекСтрока2.Заказано = null Тогда Продолжить; КонецЕсли;
				//Если ТекСтрока2.Заказано > 0 Тогда				
				//	ТЗ = ДопДанные(ТекСтрока2.Номенклатура, ТекСтрока2.Организация);
				//	Для каждого ТекТЗСтрока Из ТЗ Цикл
				//		Если ТекТЗСтрока.Поле1 >= 3 Тогда Продолжить; КонецЕсли;
				//		С = ТекСтрока2.Строки.Добавить();
				//		С.Заказано = ТекТЗСтрока.Количество;
				//		С.Номенклатура = ТекТЗСтрока.Номенклатура;
				//		С.Организация  = ТекТЗСтрока.Организация;
				//		С.Регистратор  = ТекТЗСтрока.Регистратор;
				//		С.Дата         = ТекТЗСтрока.ЗаказПоставщику.ДатаПоступления;
				//		С.ВебАдрес     = ТекТЗСтрока.AzRyНаименованияПоставщиков.ВебАдрес;
				//	КонецЦикла;
				//КонецЕсли; 
			
			КонецЦикла;
			
			Для каждого МУ Из М Цикл			
				ТекСтрока2.Строки.Удалить(МУ);	
			КонецЦикла;
			
		КонецЦикла;
		ТекСтрока.Требуется = соот["Требуется"];
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТекТаблица, "ТаблицаВыгрузки");
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивБазыТоваров()
	
	ТекТаблица = РеквизитФормыВЗначение("ТаблицаВыгрузки");
	
	МассивВыгрузки = Новый Массив();
	
	Для каждого СтрокаТЧ Из ТекТаблица Цикл
		СтруктураСтроки = Новый СписокЗначений;
		СтруктураСтроки.Добавить(СтрокаТЧ.Штрихкод);
		СтруктураСтроки.Добавить(СтрокаТЧ.Номенклатура);
		СтруктураСтроки.Добавить(СтрокаТЧ.Партия);
		СтруктураСтроки.Добавить(СтрокаТЧ.Характеристика);
		СтруктураСтроки.Добавить("");
		СтруктураСтроки.Добавить("");
		СтруктураСтроки.Добавить("");
		СтруктураСтроки.Добавить(0);
		МассивВыгрузки.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат МассивВыгрузки;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьВыполнить()
	
	ЗаполнитьБазуТоваров();
	
КонецПроцедуры

&НаСервере
Функция ДопДанные(Номенклатура, Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 		
		"ВЫБРАТЬ
		|	ЗаказыПоставщикам.Период,
		|	ЗаказыПоставщикам.Регистратор,
		|	ЗаказыПоставщикам.НомерСтроки,
		|	ЗаказыПоставщикам.Активность,
		|	ЗаказыПоставщикам.ВидДвижения КАК ВидДвижения,
		|	ЗаказыПоставщикам.Организация,
		|	ЗаказыПоставщикам.ЗаказПоставщику,
		|	ЗаказыПоставщикам.Номенклатура,
		|	ВЫБОР
		|		КОГДА ЗаказыПоставщикам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|			ТОГДА ЗаказыПоставщикам.Количество
		|		ИНАЧЕ -ЗаказыПоставщикам.Количество
		|	КОНЕЦ КАК Количество,
		|	ВЫБОР
		|		КОГДА (ЕСТЬNULL(ЗаказыПоставщикамОстаткиИОбороты.КоличествоПриход, 0) <> 0
		|				ИЛИ ЕСТЬNULL(ЗаказыПоставщикамОстаткиИОбороты.КоличествоПриход, 0) = 0)
		|				И ЕСТЬNULL(ЗаказыПоставщикамОстаткиИОбороты.КоличествоРасход, 0) = 0
		|			ТОГДА 0
		|		КОГДА ЕСТЬNULL(ЗаказыПоставщикамОстаткиИОбороты.КоличествоПриход, 0) <> 0
		|				И ЕСТЬNULL(ЗаказыПоставщикамОстаткиИОбороты.КоличествоРасход, 0) <> 0
		|				И ЕСТЬNULL(ЗаказыПоставщикамОстаткиИОбороты.КоличествоКонечныйОстаток, 0) = 0
		|			ТОГДА 3
		|		КОГДА ЕСТЬNULL(ЗакупкиОбороты.СуммаОборот, 0) <= (ВЫРАЗИТЬ(ВЫБОР
		|					КОГДА ЗаказыПоставщикам.Регистратор.Ссылка.ВалютаДокумента = КонстантаНациональнаяВалюта.Значение
		|						ТОГДА ЕСТЬNULL(ОплатаСчетовИЗаказовОбороты.СуммаОборот, 0) * КурсыРегВалюты.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * КурсыРегВалюты.Кратность)
		|					ИНАЧЕ ЕСТЬNULL(ОплатаСчетовИЗаказовОбороты.СуммаОборот, 0) * ЗаказыПоставщикам.Регистратор.Ссылка.Курс * КурсыУпрВалюты.Кратность / (КурсыУпрВалюты.Курс * ЗаказыПоставщикам.Регистратор.Ссылка.Кратность)
		|				КОНЕЦ КАК ЧИСЛО(15, 2))) / 2
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Поле1,
		|	ЗаказыПоставщикам.Номенклатура.AzRyНаименованияПоставщиков КАК AzRyНаименованияПоставщиков
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыПоставщикам.ОстаткиИОбороты(, , Авто, , ) КАК ЗаказыПоставщикамОстаткиИОбороты
		|		ПО ЗаказыПоставщикам.Регистратор.Ссылка = ЗаказыПоставщикамОстаткиИОбороты.ЗаказПоставщику
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОплатаСчетовИЗаказов.Обороты КАК ОплатаСчетовИЗаказовОбороты
		|		ПО ЗаказыПоставщикам.Регистратор.Ссылка = ОплатаСчетовИЗаказовОбороты.СчетНаОплату
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки.Обороты КАК ЗакупкиОбороты
		|		ПО ЗаказыПоставщикам.Регистратор.Ссылка = ЗакупкиОбороты.ЗаказПоставщику
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаВалютаУчета.Значение
		|					ИЗ
		|						Константа.ВалютаУчета КАК КонстантаВалютаУчета)) КАК КурсыУпрВалюты
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(
		|				,
		|				Валюта В
		|					(ВЫБРАТЬ
		|						КонстантаНациональнаяВалюта.Значение
		|					ИЗ
		|						Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта)) КАК КурсыРегВалюты
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
		|		ПО ЗаказыПоставщикам.Регистратор = ЗаказПоставщикуЗапасы.Ссылка
		|			И ЗаказыПоставщикам.НомерСтроки = ЗаказПоставщикуЗапасы.НомерСтроки,
		|	Константа.НациональнаяВалюта КАК КонстантаНациональнаяВалюта
		|ГДЕ
		|	ЗаказыПоставщикам.Номенклатура = &Номенклатура
		|	И ЗаказыПоставщикам.Организация = &Организация"
		+ ?(ДатаНачало = Дата(1,1,1), "", "И ЗаказыПоставщикам.Период >= &Период1")	
		+ ?(ДатаКонец  = Дата(1,1,1), "", "И ЗаказыПоставщикам.Период <= &Период2")	
		+ "	И ЗаказыПоставщикам.Регистратор ССЫЛКА Документ.ЗаказПоставщику
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЗаказыПоставщикам.Период " ;

	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период1", ДатаНачало);
	Запрос.УстановитьПараметр("Период2", ДатаКонец);
		
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции
 
// Процедура выполняет загрузку настроек отбора из настроек по умолчанию.
//
&НаСервере
Процедура ЗагрузитьНастройкиОтбораПоУмолчанию()
	
	СхемаКомпоновкиДанных = ЭтотОбъект().ПолучитьМакет("Макет");   
	КомпоновщикНастроек.Инициализировать(
		Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, ЭтаФорма.УникальныйИдентификатор))
	);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры // ЗагрузитьНастройкиОтбораПоУмолчанию()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьНастройкиОтбораПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Функция ЭтотОбъект()

    Обработка = РеквизитФормыВЗначение("Объект");
    Возврат Обработка;

КонецФункции

&НаСервере
Процедура СкопироватьЭлементы(ПриемникЗначения, ИсточникЗначения, ПроверятьДоступность = Ложь, ОчищатьПриемник = Истина) Экспорт
	
	Если ТипЗнч(ИсточникЗначения) = Тип("УсловноеОформлениеКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ВариантыПользовательскогоПоляВыборКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ОформляемыеПоляКомпоновкиДанных")
		ИЛИ ТипЗнч(ИсточникЗначения) = Тип("ЗначенияПараметровДанныхКомпоновкиДанных") Тогда
		СоздаватьПоТипу = Ложь;
	Иначе
		СоздаватьПоТипу = Истина;
	КонецЕсли;
	ПриемникЭлементов = ПриемникЗначения.Элементы;
	ИсточникЭлементов = ИсточникЗначения.Элементы;
	Если ОчищатьПриемник Тогда
		ПриемникЭлементов.Очистить();
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из ИсточникЭлементов Цикл
		
		Если Строка(ЭлементИсточник.ЛевоеЗначение) = "СтруктурнаяЕдиница" Тогда
			Продолжить;	
		КонецЕсли;
		
		Если ТипЗнч(ЭлементИсточник) = Тип("ЭлементПорядкаКомпоновкиДанных") Тогда
			// Элементы порядка добавляем в начало
			Индекс = ИсточникЭлементов.Индекс(ЭлементИсточник);
			ЭлементПриемник = ПриемникЭлементов.Вставить(Индекс, ТипЗнч(ЭлементИсточник));
		Иначе
			Если СоздаватьПоТипу Тогда
				ЭлементПриемник = ПриемникЭлементов.Добавить(ТипЗнч(ЭлементИсточник));
			Иначе
				ЭлементПриемник = ПриемникЭлементов.Добавить();
			КонецЕсли;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		// В некоторых коллекциях необходимо заполнить другие коллекции
		Если ТипЗнч(ИсточникЭлементов) = Тип("КоллекцияЭлементовУсловногоОформленияКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Поля, ЭлементИсточник.Поля);
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
			ЗаполнитьЭлементы(ЭлементПриемник.Оформление, ЭлементИсточник.Оформление); 
		ИначеЕсли ТипЗнч(ИсточникЭлементов)	= Тип("КоллекцияВариантовПользовательскогоПоляВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Отбор, ЭлементИсточник.Отбор);
		КонецЕсли;
		
		// В некоторых элементах коллекции необходимо заполнить другие коллекции
		Если ТипЗнч(ЭлементИсточник) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник, ЭлементИсточник);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыборКомпоновкиДанных") Тогда
			СкопироватьЭлементы(ЭлементПриемник.Варианты, ЭлементИсточник.Варианты);
		ИначеЕсли ТипЗнч(ЭлементИсточник) = Тип("ПользовательскоеПолеВыражениеКомпоновкиДанных") Тогда
			ЭлементПриемник.УстановитьВыражениеДетальныхЗаписей (ЭлементИсточник.ПолучитьВыражениеДетальныхЗаписей());
			ЭлементПриемник.УстановитьВыражениеИтоговыхЗаписей(ЭлементИсточник.ПолучитьВыражениеИтоговыхЗаписей());
			ЭлементПриемник.УстановитьПредставлениеВыраженияДетальныхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияДетальныхЗаписей ());
			ЭлементПриемник.УстановитьПредставлениеВыраженияИтоговыхЗаписей(ЭлементИсточник.ПолучитьПредставлениеВыраженияИтоговыхЗаписей ());
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЭлементы(ПриемникЗначения, ИсточникЗначения, ПервыйУровень = Неопределено) Экспорт
	
	Если ТипЗнч(ПриемникЗначения) = Тип("КоллекцияЗначенийПараметровКомпоновкиДанных") Тогда
		КоллекцияЗначений = ИсточникЗначения;
	Иначе
		КоллекцияЗначений = ИсточникЗначения.Элементы;
	КонецЕсли;
	
	Для каждого ЭлементИсточник Из КоллекцияЗначений Цикл
		Если ПервыйУровень = Неопределено Тогда
			ЭлементПриемник = ПриемникЗначения.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		Иначе
			ЭлементПриемник = ПервыйУровень.НайтиЗначениеПараметра(ЭлементИсточник.Параметр);
		КонецЕсли;
		Если ЭлементПриемник = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		Если ТипЗнч(ЭлементИсточник) = Тип("ЗначениеПараметраКомпоновкиДанных") Тогда
			Если ЭлементИсточник.ЗначенияВложенныхПараметров.Количество() <> 0 Тогда
				ЗаполнитьЭлементы(ЭлементПриемник.ЗначенияВложенныхПараметров, ЭлементИсточник.ЗначенияВложенныхПараметров, ПриемникЗначения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Если СохраненныеНастройки <> Неопределено Тогда
		
		Для Каждого КлючИЗначение Из СохраненныеНастройки Цикл
			// Обратное преобразование имени для хранения ключа соответствия для хранения в структуре
			ИмяКлюча = СтрЗаменить(КлючИЗначение.Ключ,"_QTQ_",".");
			ИмяКлюча = СтрЗаменить(ИмяКлюча,"_QPQ_"," ");
			Если ИмяКлюча = "_QQQ_" Тогда
				ИмяКлюча = "";
			КонецЕсли;
			Настройки.Вставить(ИмяКлюча, КлючИЗначение.Значение);
		КонецЦикла;
		
	Иначе
		
		// Сохранение отбора выполняется только если это не печать из документа
		Настройки.Вставить("НастройкиОтбора",Новый ХранилищеЗначения(КомпоновщикНастроек.Настройки));
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Свойство("АдресВХранилище") И ЗначениеЗаполнено(Параметры.АдресВХранилище) Тогда
		
		СохраненныеНастройки = Новый Структура;
		Для Каждого КлючИЗначение Из Настройки Цикл
			// Преобразование имени для хранения ключа соответствия для хранения в структуре
			ИмяКлюча = СтрЗаменить(КлючИЗначение.Ключ,".","_QTQ_");
			ИмяКлюча = СтрЗаменить(ИмяКлюча," ","_QPQ_");
			Если ИмяКлюча = "" Тогда
				ИмяКлюча = "_QQQ_";
			КонецЕсли;
			СохраненныеНастройки.Вставить(ИмяКлюча, КлючИЗначение.Значение);
		КонецЦикла;
		
		Настройки.Очистить();
		
	Иначе
		
		НастройкиОтбора = Настройки.Получить("НастройкиОтбора");
		Если НастройкиОтбора <> Неопределено Тогда
			КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиОтбора.Получить());
		Иначе
			ЗагрузитьНастройкиОтбораПоУмолчанию();
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция НСтроку(ТекСтрока, Кол, СтрИскм)

	
	Для Н = 0 По Кол Цикл
		С = "И " + СтрИскм + " &П" + Н;
		Если СтрЧислоВхождений(ТекСтрока, С) > 0 Тогда		
			Возврат С;	
		КонецЕсли; 	
	КонецЦикла;	
	
	Для Н = 0 По Кол Цикл
		С = СтрИскм + " &П" + Н;
		Если СтрЧислоВхождений(ТекСтрока, С) > 0 Тогда		
			Возврат С;	
		КонецЕсли; 	
	КонецЦикла;				 

КонецФункции
